sergev/pic32prog/adapter-mpsse.c
    /* Send a packet. */
    mpsse_flush_output(a);

    /* Process a reply: one 64-bit word. */
    memcpy(&word, a->input, sizeof(word));
    return mpsse_fix_data(a, word);
}

static void mpsse_reset(mpsse_adapter_t *a, int trst, int sysrst, int led)
{
    unsigned char buf [3];
    unsigned output    = 0x0008;                    /* TCK idle high */
    unsigned direction = 0x000b | a->dir_control;

    if (trst)
        output |= a->trst_control;
    if (a->trst_inverted)
        output ^= a->trst_control;

    if (sysrst)
        output |= a->sysrst_control;
    if (a->sysrst_inverted)
        output ^= a->sysrst_control;

    if (led)
        output |= a->led_control;
    if (a->led_inverted)
        output ^= a->led_control;

    /* command "set data bits low byte" */
    buf [0] = 0x80;
    buf [1] = output;
    buf [2] = direction;
    bulk_write(a, buf, 3);

    /* command "set data bits high byte" */
    buf [0] = 0x82;
    buf [1] = output >> 8;
    buf [2] = direction >> 8;
    bulk_write(a, buf, 3);

    if (debug_level)
        fprintf(stderr, "mpsse_reset(trst=%d, sysrst=%d) output=%04x, direction: %04x\n",
            trst, sysrst, output, direction);
}

static void mpsse_speed(mpsse_adapter_t *a, int khz)
{
    unsigned char output [3];
    int divisor = (a->mhz * 2000 / khz + 1) / 2 - 1;

    if (divisor < 0)
        divisor = 0;
    if (debug_level)
    	fprintf(stderr, "%s: divisor: %u\n", a->name, divisor);

    if (a->mhz > 6) {
        /* Use 60MHz master clock (disable divide by 5). */
        output [0] = 0x8A;

        /* Turn off adaptive clocking. */
        output [1] = 0x97;

        /* Disable three-phase clocking. */
        output [2] = 0x8D;
        bulk_write(a, output, 3);
    }

    /* Command "set TCK divisor". */
    output [0] = 0x86;
    output [1] = divisor;
    output [2] = divisor >> 8;
    bulk_write(a, output, 3);

    if (debug_level) {
        khz = (a->mhz * 2000 / (divisor + 1) + 1) / 2;
        fprintf(stderr, "%s: clock rate %.1f MHz\n", a->name, khz / 1000.0);
    }
}

static void mpsse_close(adapter_t *adapter, int power_on)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;

    /* Clear EJTAGBOOT mode. */
    mpsse_send(a, 1, 1, 5, TAP_SW_ETAP, 0);     /* Send command. */
    mpsse_send(a, 6, 31, 0, 0, 0);              /* TMS 1-1-1-1-1-0 */
    mpsse_flush_output(a);

    /* Toggle /SYSRST. */
    mpsse_reset(a, 0, 1, 1);
    mpsse_reset(a, 0, 0, 0);

    libusb_release_interface(a->usbdev, 0);
    libusb_close(a->usbdev);
    free(a);
}

/*
 * Read the Device Identification code
 */
static unsigned mpsse_get_idcode(adapter_t *adapter)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;
    unsigned idcode;

    /* Reset the JTAG TAP controller: TMS 1-1-1-1-1-0.
     * After reset, the IDCODE register is always selected.
     * Read out 32 bits of data. */
    mpsse_send(a, 6, 31, 32, 0, 1);
    idcode = mpsse_recv(a);
    return idcode;
}

/*
 * Put device to serial execution mode.
 */
static void serial_execution(mpsse_adapter_t *a)
{
    if (a->serial_execution_mode)
        return;
    a->serial_execution_mode = 1;

    /* Enter serial execution. */
    if (debug_level > 0)
        fprintf(stderr, "%s: enter serial execution\n", a->name);

    mpsse_send(a, 1, 1, 5, TAP_SW_ETAP, 0);     /* Send command. */
    mpsse_send(a, 1, 1, 5, ETAP_EJTAGBOOT, 0);  /* Send command. */

    /* Check status. */
    mpsse_send(a, 1, 1, 5, TAP_SW_MTAP, 0);     /* Send command. */
    mpsse_send(a, 1, 1, 5, MTAP_COMMAND, 0);    /* Send command. */
    mpsse_send(a, 0, 0, 8, MCHP_DEASSERT_RST, 0);  /* Xfer data. */
    mpsse_send(a, 0, 0, 8, MCHP_FLASH_ENABLE, 0);  /* Xfer data. */
    mpsse_send(a, 0, 0, 8, MCHP_STATUS, 1);     /* Xfer data. */
    unsigned status = mpsse_recv(a);
    if (debug_level > 0)
        fprintf(stderr, "%s: status %04x\n", a->name, status);
    if ((status & ~MCHP_STATUS_DEVRST) !=
        (MCHP_STATUS_CPS | MCHP_STATUS_CFGRDY | MCHP_STATUS_FAEN)) {
        fprintf(stderr, "%s: invalid status = %04x (reset)\n", a->name, status);
        exit(-1);
    }

    /* Deactivate /SYSRST. */
    mpsse_reset(a, 0, 0, 1);
    mdelay(10);

    /* Check status. */
    mpsse_send(a, 1, 1, 5, TAP_SW_MTAP, 0);     /* Send command. */
    mpsse_send(a, 1, 1, 5, MTAP_COMMAND, 0);    /* Send command. */
    mpsse_send(a, 0, 0, 8, MCHP_STATUS, 1);     /* Xfer data. */
    status = mpsse_recv(a);
    if (debug_level > 0)
        fprintf(stderr, "%s: status %04x\n", a->name, status);
    if (status != (MCHP_STATUS_CPS | MCHP_STATUS_CFGRDY |
                   MCHP_STATUS_FAEN)) {
        fprintf(stderr, "%s: invalid status = %04x (no reset)\n", a->name, status);
        exit(-1);
    }

    /* Leave it in ETAP mode. */
    mpsse_send(a, 1, 1, 5, TAP_SW_ETAP, 0);     /* Send command. */
    mpsse_flush_output(a);
}

static void xfer_fastdata(mpsse_adapter_t *a, unsigned word)
{
    mpsse_send(a, 0, 0, 33, (unsigned long long) word << 1, 0);
}

static void xfer_instruction(mpsse_adapter_t *a, unsigned instruction)
{
    unsigned ctl;

    if (debug_level > 1)
        fprintf(stderr, "%s: xfer instruction %08x\n", a->name, instruction);

    // Select Control Register
    mpsse_send(a, 1, 1, 5, ETAP_CONTROL, 0);        /* Send command. */

    // Wait until CPU is ready
    // Check if Processor Access bit (bit 18) is set
    do {
        mpsse_send(a, 0, 0, 32, CONTROL_PRACC |     /* Xfer data. */
                                CONTROL_PROBEN |
                                CONTROL_PROBTRAP |
                                CONTROL_EJTAGBRK, 1);
        ctl = mpsse_recv(a);
    } while (! (ctl & CONTROL_PRACC));

    // Select Data Register
    // Send the instruction
    mpsse_send(a, 1, 1, 5, ETAP_DATA, 0);           /* Send command. */
    mpsse_send(a, 0, 0, 32, instruction, 0);        /* Send data. */

    // Tell CPU to execute instruction
    mpsse_send(a, 1, 1, 5, ETAP_CONTROL, 0);        /* Send command. */
    mpsse_send(a, 0, 0, 32, CONTROL_PROBEN |        /* Send data. */
                            CONTROL_PROBTRAP, 0);
}

static unsigned get_pe_response(mpsse_adapter_t *a)
{
    unsigned ctl, response;

