sergev/pic32prog/adapter-mpsse.c
/*
 * Erase all flash memory.
 */
static void mpsse_erase_chip(adapter_t *adapter)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;

    mpsse_send(a, 1, 1, 5, TAP_SW_MTAP, 0);     /* Send command. */
    mpsse_send(a, 1, 1, 5, MTAP_COMMAND, 0);    /* Send command. */
    mpsse_send(a, 0, 0, 8, MCHP_ERASE, 0);      /* Xfer data. */
    mpsse_flush_output(a);
    mdelay(400);

    /* Leave it in ETAP mode. */
    mpsse_send(a, 1, 1, 5, TAP_SW_ETAP, 0);     /* Send command. */
}

/*
 * Write a word to flash memory.
 */
static void mpsse_program_word(adapter_t *adapter,
    unsigned addr, unsigned word)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;

    if (debug_level > 0)
        fprintf(stderr, "%s: program word at %08x: %08x\n", a->name, addr, word);
    if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "%s: slow flash write not implemented yet.\n", a->name);
        exit(-1);
    }

    /* Use PE to write flash memory. */
    mpsse_send(a, 1, 1, 5, ETAP_FASTDATA, 0);   /* Send command. */
    xfer_fastdata(a, PE_WORD_PROGRAM << 16 | 2);
    mpsse_flush_output(a);
    xfer_fastdata(a, addr);                     /* Send address. */
    mpsse_flush_output(a);
    xfer_fastdata(a, word);                     /* Send word. */

    unsigned response = get_pe_response(a);
    if (response != (PE_WORD_PROGRAM << 16)) {
        fprintf(stderr, "%s: failed to program word %08x at %08x, reply = %08x\n",
            a->name, word, addr, response);
        exit(-1);
    }
}

/*
 * Flash write row of memory.
 */
static void mpsse_program_row(adapter_t *adapter, unsigned addr,
    unsigned *data, unsigned words_per_row)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;
    int i;

    if (debug_level > 0)
        fprintf(stderr, "%s: row program %u words at %08x\n",
            a->name, words_per_row, addr);
    if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "%s: slow flash write not implemented yet.\n", a->name);
        exit(-1);
    }

    /* Use PE to write flash memory. */
    mpsse_send(a, 1, 1, 5, ETAP_FASTDATA, 0);   /* Send command. */
    xfer_fastdata(a, PE_ROW_PROGRAM << 16 | words_per_row);
    mpsse_flush_output(a);
    xfer_fastdata(a, addr);                     /* Send address. */

    /* Download data. */
    for (i = 0; i < words_per_row; i++) {
        if ((i & 7) == 0)
            mpsse_flush_output(a);
        xfer_fastdata(a, *data++);              /* Send word. */
    }
    mpsse_flush_output(a);

    unsigned response = get_pe_response(a);
    if (response != (PE_ROW_PROGRAM << 16)) {
        fprintf(stderr, "%s: failed to program row at %08x, reply = %08x\n",
            a->name, addr, response);
        exit(-1);
    }
}

/*
 * Verify a block of memory.
 */
static void mpsse_verify_data(adapter_t *adapter,
    unsigned addr, unsigned nwords, unsigned *data)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;
    unsigned data_crc, flash_crc;

    //fprintf(stderr, "%s: verify %d words at %08x\n", a->name, nwords, addr);
    if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "%s: slow verify not implemented yet.\n", a->name);
        exit(-1);
    }

    /* Use PE to get CRC of flash memory. */
    mpsse_send(a, 1, 1, 5, ETAP_FASTDATA, 0);   /* Send command. */
    xfer_fastdata(a, PE_GET_CRC << 16);
    mpsse_flush_output(a);
    xfer_fastdata(a, addr);                     /* Send address. */
    mpsse_flush_output(a);
    xfer_fastdata(a, nwords * 4);               /* Send length. */

    unsigned response = get_pe_response(a);
    if (response != (PE_GET_CRC << 16)) {
        fprintf(stderr, "%s: failed to verify %d words at %08x, reply = %08x\n",
            a->name, nwords, addr, response);
        exit(-1);
    }
    flash_crc = get_pe_response(a) & 0xffff;

    data_crc = calculate_crc(0xffff, (unsigned char*) data, nwords * 4);
    if (flash_crc != data_crc) {
        fprintf(stderr, "%s: checksum failed at %08x: sum=%04x, expected=%04x\n",
            a->name, addr, flash_crc, data_crc);
        //exit(-1);
    }
}

/*
 * Initialize adapter F2232.
 * Return a pointer to a data structure, allocated dynamically.
 * When adapter not found, return 0.
 * Parameters vid, pid and serial are not used.
 */
adapter_t *adapter_open_mpsse(int vid, int pid, const char *serial)
{
    mpsse_adapter_t *a;
    unsigned char product [256];
    int i;

    a = calloc(1, sizeof(*a));
    if (! a) {
        fprintf(stderr, "adapter_open_mpsse: out of memory\n");
        return 0;
    }
    a->context = NULL;
    int ret = libusb_init(&a->context);

    if (ret != 0) {
        fprintf(stderr, "libusb init failed: %d: %s\n",
            ret, libusb_strerror(ret));
        exit(-1);
    }

    for (i = 0; devlist[i].vid; i++) {
        a->usbdev = libusb_open_device_with_vid_pid(a->context, devlist[i].vid, devlist[i].pid);
        if (a->usbdev != NULL) {
            int match = 1;
            if (devlist[i].product != NULL) {

                struct libusb_device_descriptor desc = {0};
                int rc = libusb_get_device_descriptor(libusb_get_device(a->usbdev), &desc);
                if (rc != 0) {
                    match = 0;
                } else {
                    rc = libusb_get_string_descriptor_ascii(a->usbdev, desc.iProduct, product, 256);

                    if (strcmp((const char *)product, devlist[i].product) != 0) {
                        match = 0;
                    }
                }
            }

            if (match == 1) {
                a->name = devlist[i].name;
                a->mhz = devlist[i].mhz;
                a->dir_control      = devlist[i].dir_control;
                a->trst_control     = devlist[i].trst_control;
                a->trst_inverted    = devlist[i].trst_inverted;
                a->sysrst_control   = devlist[i].sysrst_control;
                a->sysrst_inverted  = devlist[i].sysrst_inverted;
                a->led_control      = devlist[i].led_control;
                a->led_inverted     = devlist[i].led_inverted;
                goto found;
            }
        }
    }

    free(a);
    return 0;

found:
    /*fprintf(stderr, "found USB adapter: vid %04x, pid %04x, type %03x\n",
        dev->descriptor.idVendor, dev->descriptor.idProduct,
        dev->descriptor.bcdDevice);*/

    ret = libusb_detach_kernel_driver(a->usbdev, 0);
    if (ret != 0) {
        fprintf(stderr, "Error detaching kernel driver: %d: %s\n",
            ret, libusb_strerror(ret));
        libusb_close(a->usbdev);
        exit(-1);
    }

    libusb_claim_interface(a->usbdev, 0);

    /* Reset the ftdi device. */
    if (libusb_control_transfer(a->usbdev,
        LIBUSB_REQUEST_TYPE_VENDOR | LIBUSB_RECIPIENT_DEVICE | LIBUSB_ENDPOINT_OUT,
        SIO_RESET, 0, 1, 0, 0, 1000) != 0) {
        if (errno == EPERM)
            fprintf(stderr, "%s: superuser privileges needed.\n", a->name);
        else
            fprintf(stderr, "%s: FTDI reset failed\n", a->name);
failed: libusb_release_interface(a->usbdev, 0);
        libusb_close(a->usbdev);
        free(a);
        return 0;
    }

    /* MPSSE mode. */
    if (libusb_control_transfer(a->usbdev,
        LIBUSB_REQUEST_TYPE_VENDOR | LIBUSB_RECIPIENT_DEVICE | LIBUSB_ENDPOINT_OUT,
        SIO_SET_BITMODE, 0x20b, 1, 0, 0, 1000) != 0) {
        fprintf(stderr, "%s: can't set sync mpsse mode\n", a->name);
        goto failed;
    }

    /* Optimal latency timer is 1 for slow mode and 0 for fast mode. */
    unsigned latency_timer = (a->mhz > 6) ? 0 : 1;
    if (libusb_control_transfer(a->usbdev,
        LIBUSB_REQUEST_TYPE_VENDOR | LIBUSB_RECIPIENT_DEVICE | LIBUSB_ENDPOINT_OUT,
        SIO_SET_LATENCY_TIMER, latency_timer, 1, 0, 0, 1000) != 0) {
        fprintf(stderr, "%s: unable to set latency timer\n", a->name);
        goto failed;
    }
    if (libusb_control_transfer(a->usbdev,
        LIBUSB_REQUEST_TYPE_VENDOR | LIBUSB_RECIPIENT_DEVICE | LIBUSB_ENDPOINT_IN,
        SIO_GET_LATENCY_TIMER, 0, 1, (unsigned char*) &latency_timer, 1, 1000) != 1) {
        fprintf(stderr, "%s: unable to get latency timer\n", a->name);
        goto failed;
    }
    if (debug_level)
    	fprintf(stderr, "%s: latency timer: %u usec\n", a->name, latency_timer);

    /* By default, use 500 kHz speed. */
    int khz = 500;
    mpsse_speed(a, khz);

    /* Disable TDI to TDO loopback. */
    unsigned char enable_loopback[] = "\x85";
    bulk_write(a, enable_loopback, 1);

    /* Activate LED. */
    mpsse_reset(a, 0, 0, 1);

    /* Reset the JTAG TAP controller: TMS 1-1-1-1-1-0.
     * After reset, the IDCODE register is always selected.
     * Read out 32 bits of data. */
    unsigned idcode;
    mpsse_send(a, 6, 31, 32, 0, 1);
    idcode = mpsse_recv(a);
    if ((idcode & 0xfff) != 0x053) {
        /* Microchip vendor ID is expected. */
        if (debug_level > 0 || (idcode != 0 && idcode != 0xffffffff))
            fprintf(stderr, "%s: incompatible CPU detected, IDCODE=%08x\n",
                a->name, idcode);
        mpsse_reset(a, 0, 0, 0);
        goto failed;
    }

    /* Activate /SYSRST and LED. */
    mpsse_reset(a, 0, 1, 1);
    mdelay(10);

    /* Check status. */
    mpsse_send(a, 1, 1, 5, TAP_SW_MTAP, 0);         /* Send command. */
    mpsse_send(a, 1, 1, 5, MTAP_COMMAND, 0);        /* Send command. */
    mpsse_send(a, 0, 0, 8, MCHP_FLASH_ENABLE, 0);   /* Xfer data. */
    mpsse_send(a, 0, 0, 8, MCHP_STATUS, 1);         /* Xfer data. */
    unsigned status = mpsse_recv(a);
    if (debug_level > 0)
        fprintf(stderr, "%s: status %04x\n", a->name, status);
    if ((status & ~MCHP_STATUS_DEVRST) !=
        (MCHP_STATUS_CPS | MCHP_STATUS_CFGRDY | MCHP_STATUS_FAEN)) {
        fprintf(stderr, "%s: invalid status = %04x\n", a->name, status);
        mpsse_reset(a, 0, 0, 0);
        goto failed;
    }
    printf("      Adapter: %s\n", a->name);

    a->adapter.block_override = 0;
    a->adapter.flags = (AD_PROBE | AD_ERASE | AD_READ | AD_WRITE);

    /* User functions. */
    a->adapter.close = mpsse_close;
    a->adapter.get_idcode = mpsse_get_idcode;
    a->adapter.load_executive = mpsse_load_executive;
    a->adapter.read_word = mpsse_read_word;
    a->adapter.read_data = mpsse_read_data;
    a->adapter.verify_data = mpsse_verify_data;
    a->adapter.erase_chip = mpsse_erase_chip;
    a->adapter.program_word = mpsse_program_word;
    a->adapter.program_row = mpsse_program_row;
    return &a->adapter;
}
